const getAboutData = () => {
    const data = {
        pageHeader: {
            title: "שמחים להכיר אתכם",
        },
        // aboutMission: {
        //     title: "השליחות שלנו",
        //     subtitle: "אהבה לטבע, לאסתטיקה ולחיבור אנושי מניעה את כל מה שאנחנו עושים.",
        //     points: [
        //         "ליצור חוויות יצירתיות ושקטות שמאפשרות לאנשים להתנתק מהשגרה.",
        //         "לחבר בין אנשים דרך עשייה משותפת, חיבור לטבע ויצירה אישית.",
        //         "להנגיש כלים פשוטים שמזמינים ביטוי עצמי, רוגע וצמיחה אישית.",
        //         "לקדם תרבות של קהילה, מקצועיות, איכות ויחס אישי בכל סדנה."
        //     ]
        // },
        // aboutValues: {
        //     title: "הערכים שלנו",
        //     values: [
        //         {
        //             title: "יצירתיות",
        //             description: "הסדנאות שלנו מעוצבות להעניק מרחב חופשי לביטוי אישי ולדמיון."
        //         },
        //         {
        //             title: "טבע",
        //             description: "החומרים שלנו מגיעים מהטבע, ומביאים תחושת חיבור, שקט והרמוניה."
        //         },
        //         {
        //             title: "קהילה",
        //             description: "אנו מחויבים ליצירת מרחבים משותפים שמחברים בין אנשים."
        //         },
        //         {
        //             title: "מקצועיות",
        //             description: "הצוות שלנו מלווה כל סדנה בידע, ניסיון ותשומת לב אישית."
        //         }
        //     ]
        // },
        openForm: {
            title: "מעוניינים בסדנה מותאמת אישית?",
            description: "מלאו את הפרטים ונחזור אליכם בהקדם.",
        },
        testimonials: {
            title: "לקוחות ממליצים",
            testimonials: [
                // NEED TO BE REPLACED 
                {
                    name: "דנה לוי",
                    quote: "הסדנה הייתה מדהימה! התחברתי לטבע, הרגשתי חופשית ויצירתית. חוויה מרגיעה ובלתי נשכחת. זו הייתה הזדמנות להתחבר לעצמי ולסביבה בצורה שלא חוויתי בעבר. כל רגע היה מלא בהשראה, והצוות היה קשוב ומקצועי. אני ממליצה לכל אחד לנסות את החוויה הזו, כי היא באמת משנה חיים. תודה על רגעים קסומים של יצירה, חיבור ושקט פנימי.",
                    role: "משתתפת בסדנת טרריום",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379392/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.49.39_pugj7r.jpg",
                        alt: "תמונה של דנה לוי"
                    }
                },
                // NEED TO BE REPLACED 
                {
                    name: "נועה ברק",
                    quote: "חוויה מרגשת עם צוות מקצועי ומקום קסום. ממליצה בחום לכל מי שמחפש רגע של שקט. הסדנה הייתה מעבר לציפיות שלי, עם אווירה מיוחדת שמזמינה רוגע ויצירתיות. הרגשתי שאני יכולה להתנתק מהשגרה ולהתחבר לעצמי בצורה עמוקה. הצוות היה מדהים, והחומרים היו איכותיים ומעוררי השראה. אני בטוחה שאחזור שוב לחוות את הקסם הזה.",
                    role: "מנהלת משאבי אנוש",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379392/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.49.49_zblyoi.jpg",
                        alt: "תמונה של נועה ברק"
                    }
                },
                // NEED TO BE REPLACED 
                {
                    name: "גלית כהן",
                    quote: "לא ציפיתי שזה ישפיע עליי כל כך. סדנה מושקעת ומרגיעה שהשפיעה עליי גם אחרי שהסתיימה. זו הייתה חוויה יוצאת דופן שהשאירה בי תחושה של שלווה והשראה. כל פרט היה מתוכנן בקפידה, והאווירה הייתה כל כך נעימה ומרגיעה. אני מרגישה שהסדנה הזו נתנה לי כלים להתמודדות עם השגרה בצורה טובה יותר. תודה על חוויה בלתי נשכחת שממשיכה ללוות אותי גם היום.",
                    role: "מטפלת רגשית",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379391/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.49.25_exulqi.jpg",
                        alt: "תמונה של גלית כהן"
                    }
                },
            ]
        },
        aboutUs: {
            paragraphs: [
                "אני אייל ואני עוסק בעולמות העיצוב והטבע כל חיי.",
                "אנימטור במקצועי וחובב צמחים וטבע מילדותי תמיד אוהב להתנסות, ליצור ולגלות טכניקות וכלים חדשים. בטחב התאהבתי בבגרותי, צמח כה מיוחד ונדיר בישראל, המטהר את האוויר שאנו נושמים ובעל תכונות ייחודיות רבות. בתקופת הקורונה התגעגעתי לטבע והתחלתי לבנות טרריומים עם טחב ולשלב בהם צמחים ואלמנטים נוספים.",
                "כך התפתחתי לעיצוב ובנייה של טרריומים ותוך כדי מצאתי את עצמי נשאב למחקר מעמיק על העולם המדהים והמרתק של הטחב, ואפילו מגדל טחב מסוגים שונים.",
                "תהליך העיצוב והיצירה של הטרריום תמיד גורם לי לתחושת שלווה, אני שוקע לתוך תהליך היצירה ומוצא את עצמי מתמלא ברוגע והשראה.",
                "מקווה שגם אתם תתחברו לתשוקה שלי ותמצאו את השלווה וההשראה שלכם בטרריום ובטחב.",
            ],
            media: {
                type: "image",
                src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1749893918/sphog/%D7%A9%D7%9E%D7%97%D7%99%D7%9D_%D7%9C%D7%94%D7%9B%D7%99%D7%A8_%D7%90%D7%AA%D7%9B%D7%9D_%D7%9E%D7%99_%D7%90%D7%A0%D7%97%D7%A0%D7%95_ngbq8s.webp",
                alt: "צוות SPHOG בסדנה",
                isPortrait: false,
            },
        },
        shortsShowcase: {
            title: "מתוך התשוקה לטבע צמח לו חלום על עולם קטן בתוך זכוכית",
            paragraphs: [
                "התחלתי עם תשוקה פשוטה לעיצוב טרריומים מגוונים שימשיכו להתפתח ולרגש לאורך שנים, ולאחר שנים של ניסיון המשכתי לסדנאות הכוללות טכניקות ועיצובים שונים מתוך הידע והניסיון שצברתי לאורך הדרך.",
            ],
            media: {
                type: "video",
                src: "https://www.youtube.com/embed/5WsxxN3fet8",
                alt: "YouTube Shorts Video",
                isPortrait: true,
            },
        },
    }

    return data
}

export default getAboutData