const getHomeData = () => {
    const data = {
        hero: {
            isEnabled: true,
            title: "Sphog טרריום וסדנאות",
            subtitle: "טבע שהוא יצירה",
            paragraphs: [
                "הצטרפו לעולם הקסום של הטרריום! ",
                "בואו לחוויה יצירתית, מרגיעה ומהנה ותבראו עולם ירוק שהוא כולו שלכם. וגם מבחר של טרריומים בעיצוב אמן לרכישה.",
            ],
            ctaText: "אני רוצה לשמוע עוד! ",
            // ctaLink: "https://wa.me/972526855222",
            image: {
                src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747997793/sphog/glass-terrarium-with-succulents-and-greenery-free-png_hprg6n.webp",
                alt: "תמונה ראשית - טרריום"
            }
        },
        shortsShowcase: {
            isEnabled: true,
            title: "על הסדנאות שלנו",
            paragraphs: [
                "בסדנאות אנחנו מלמדים את אומנות הכנת הטרריום.",
                "השאירו את המרוץ היומיומי והלחץ מאחור ובואו לגלות עולם של שלווה ויצירה. בסדנאות הטרריום שלנו, אנחנו מזמינים אתכם להתנתק מהשגרה וליצור אומנות בוטנית חיה.",
                "גלו את הכוח המרגיע של הטרריום:",
                "בואו לשחרר את היצירתיות, ליהנות מזמן איכות ולצרת עם יצירת אמנות ירוקה שתלווה אתכם ותעורר השראה כל יום מחדש.",
            ],
            points: [
                "יצירה אישית ומרגשת: צרו פסל בוטני חי וייחודי - טרריום שכולו אתם. אנחנו נספק לכם את כל הידע הכלים והחומרים האיכותיים, אתם תביאו את ההשראה והדמיון שלכם.",
                "התנתקות ושחרור: תוך כדי עבודה עם מגוון צמחים וטחבים, תגלו איך הגוף והנפש מתחברים. תופתעו לגלות כמה רוגע ושלווה טמונים בעבודה עם הטרריום, בעיצוב ומיקרו-שתילה וממימוש של היצירתיות שבכם.",
                "קסם מתפתח: הטרריום שתכינו ימשיך להתפתח ולצמוח בביתכם, ועם כל עלה חדש, תגלו מחדש את הקסם שבו ואת החיבור המיוחד שיצרתם.",
            ],
            media: {
                type: "video",
                alt: "YouTube Shorts",
                src: "https://www.youtube.com/embed/5WsxxN3fet8",
                isPortrait: true
            }
        },
        workshopPreviewData: {
            isEnabled: true,
            title: "בחרו את סדנת החלומות שלכם",
            workshop: {
                paragraphs: [
                    "יש  לנו סדנאות שמתאימות למתחילים וגם למי שכבר הכין טרריום אחד או שניים נלמד טכניקות ליצירת עיצובים שונים וניצור פיסת עולם בתוך מיכל זכוכית  בה הרגע היפה ביותר נשמר ומתפתח יחד איתך.",
                    "אז איזו סדנא מתאימה לכם?",
                ],
                image: {
                    src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824381/sphog/5_qjkatd.jpg",
                    alt: "תמונה של סדנה פרטית"
                },
                links: [
                    {
                        text: "להצטרף לסדנא קבוצתית",
                        href: "/public-workshops"
                    },
                    {
                        text: "לתאם סדנא פרטית",
                        href: "/private-workshops"
                    }
                ]
            },
        },
        storeTeaser: {
            isEnabled: true,
            title: "הצצה לחנות",
            link: {
                text: "מעבר לחנות",
                href: "/store"
            },
            products: [
                {
                    _id: 2,
                    name: "ערכת טרריום למתחילים",
                    description: "כל מה שצריך כדי להתחיל ליצור טרריום בבית – כולל כלים, אדמה, צמחייה והסברים.",
                    isInStock: true,
                    price: 129.99,
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747761469/sphog/small-terrarium-glass-jar-with-cork-top_pz3j3b.jpg",
                        alt: "ערכת טרריום למתחילים",
                    },
                },
                {
                    _id: 1,
                    name: "טרריום מוכן בעבודת יד",
                    description: "טרריום ייחודי ומוכן מראש, מתאים למתנה או לעיצוב הבית בצורה טבעית.",
                    isInStock: true,
                    price: 99.99,
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747761471/sphog/glass-vase-with-rocks-plants-white-clear-surface-png-transparent-background_dc7dqm.jpg",
                        alt: "טרריום מוכן בעבודת יד",
                    },
                },
                {
                    _id: 3,
                    name: "אקססוריז לטרריום",
                    isInStock: true,
                    price: 49.99,
                    description: "פריטים משלימים ליצירת טרריום אישי: אבנים, פסלונים קטנים, כלים ועוד.",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747761470/sphog/modern-glass-terrarium-filled-with-succulents_nwmyth.jpg",
                        alt: "אביזרים לטרריום",
                    },
                },
            ]
        },
        tipsSection: {
            isEnabled: false,
            title: "טרריום Academy לטרריום מושלם",
            link: {
                text: "לטרריום Academy",
                href: "/tips"
            },
            tips:
                [
                    {
                        _id: 1,
                        title: "איך לשמור על הטרריום בבית",
                        description: "טרריום אוהב שקט, יציבות ואור – אבל לא שמש ישירה. הנה מה שחשוב לדעת:",
                        paragraphs: [
                            "הכי טוב להאיר בתאורת לד לבנה. אפשר גם למקם אותו במקום מואר (כמו אור שקריא בו ספר), אבל בלי שמש ישירה! רצוי מאוד בחדר מאוורר.",
                            "לרסס את הטחב והעלים רק במים מזוקקים, 1–2 פעמים בשבוע, תלוי במזג האוויר ואטימות הכלי. חשוב לא לשפוך מים ולוודא שהטרריום לא מוצף במים.",
                            "הוא אוהב טמפרטורה של 10°–25°, זה מושלם בשבילו. מעל 32° – עלול להיהרס. ותזכרו שטרריום סגור צומח לאט – וזה בדיוק הקסם 🌱",
                        ],
                        image: {
                            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824379/sphog/6_c1w4lp.jpg",
                            alt: "טרריום עם טיפות מים",
                        },
                    },
                    {
                        _id: 2,
                        title: "הטרריום שלי חולה?",
                        description: "אלו הדברים הבסיסים שאתם צריכים להיזהר מהם, ומה כדאי לעשות:",
                        paragraphs: [
                            "עובש - קורים לבנים בין העלים? פלומה לבנבנה או אפורה שמוופיעה לפתע? זה העובש שהתנגב לו ומאיים על איזון הטרריום. מה לעשות? הסירו את החלקים המלאים בעובש עם פינצטה. חטאו את המקום בעזרת קיסם אוזניים טבול במי חמצן 5% (אפשר להשיג ברשתות הפארם), אחרי אוורור של כמה דקות יש לרסס במים מזוקקים ולעקוב במשך כמה ימים שהעובש לא חזר.",
                            "ריח רע - מריח קצת כמו ריקבון או ביוב? הטרריום שלכם יצא מאיזון ואתם צריכים להוסיף קצת פחם שינטרל את הזיהום ויטהר את הסביבה.",
                        ],
                        image: {
                            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824379/sphog/7_d1gf6g.jpg",
                            alt: "בחירת צמחים לטרריום",
                        },
                    },
                    // {
                    //   _id: 3,
                    //   title: "אוורור נכון של טרריום",
                    //   description:
                    //     "מומלץ לפתוח את הטרריום הסגור אחת לשבוע ל-30 דקות כדי לאזן את הלחות ולמנוע התפתחות עובש.",
                    //   image: {
                    //     src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824381/sphog/5_qjkatd.jpg",
                    //     alt: "פתיחת טרריום לאוורור",
                    //   },
                    // },
                    // {
                    //   _id: 4,
                    //   title: "שכבות נכונות בבסיס הטרריום",
                    //   description:
                    //     "הבסיס המומלץ לטרריום כולל חצץ לניקוז, שכבת פחם פעיל לטיהור ריחות ואז אדמה איכותית. הסדר הזה קריטי לבריאות הצמחים.",
                    //   image: {
                    //     src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747811095/sphog/workshop1_xqufgq.jpg",
                    //     alt: "שכבות חצץ ואדמה בטרריום",
                    //   },
                    // },
                ],
        },
        aboutUs: {
            isEnabled: false,
            title: "שמחים להכיר אתכם",
            paragraphs: [
                "אני אייל ואני עוסק בעולמות העיצוב והטבע כל חיי.",
                "אנימטור במקצועי וחובב צמחים וטבע מילדותי תמיד אוהב להתנסות, ליצור ולגלות טכניקות וכלים חדשים. בטחב התאהבתי בבגרותי, צמח כה מיוחד ונדיר בישראל, המטהר את האוויר שאנו נושמים ובעל תכונות ייחודיות רבות. בתקופת הקורונה התגעגעתי לטבע והתחלתי לבנות טרריומים עם טחב ולשלב בהם צמחים ואלמנטים נוספים.",
                "כך התפתחתי לעיצוב ובנייה של טרריומים ותוך כדי מצאתי את עצמי נשאב למחקר מעמיק על העולם המדהים והמרתק של הטחב, ואפילו מגדל טחב מסוגים שונים.",
                "תהליך העיצוב והיצירה של הטרריום תמיד גורם לי לתחושת שלווה, אני שוקע לתוך תהליך היצירה ומוצא את עצמי מתמלא ברוגע והשראה.",
                "מקווה שגם אתם תתחברו לתשוקה שלי ותמצאו את השלווה וההשראה שלכם בטרריום ובטחב.",
            ],
            description:
                "אנחנו ב-SPHOG מאמינים ביצירה מתוך אהבה לטבע. הסדנאות שלנו נוצרו כדי לאפשר לכל אחד לבטא את היצירתיות שלו באמצעות הטרריום – יצירה טבעית, אישית ומרגיעה.",
            media: {
                type: "image",
                src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747765974/sphog/2_kqpsha.png",
                alt: "צוות SPHOG בסדנה",
                isPortrait: false,
            },
            link: {
                text: "קראו עוד עלינו",
                href: "/about",
            }
        },
        bannerImage: {
            isEnabled: true,
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747765974/sphog/2_kqpsha.png",
            alt: "תמונת בית",
        },
        header: {
            isEnabled: true,
            title: "הבית שלך מתחיל כאן",
            description: "מגוון סדנאות, טרריום Academy ומוצרים לעיצוב הבית והגינה",
        },
        testimonials: {
            isEnabled: true,
            title: "לקוחות ממליצים",
            testimonials: [
                {
                    name: "רוני אבירם",
                    quote: "האתר שלכם כל כך מזמין ונעים, ישר גורם לרצות להירשם לסדנה. אני לא זוכרת מתי בפעם האחרונה נתקלתי באתר כל כך מושקע, עם עיצוב שמרגיש אישי ומחבק. זה פשוט נותן תחושה של בית, וזה בדיוק מה שחיפשתי. תודה רבה לכם על ההשקעה והאכפתיות!",
                    role: "מבקרת באתר",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379390/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.49.07_xlauuw.jpg",
                        alt: "תמונה של רוני אבירם",
                    },
                },
                {
                    name: "דניאל כהן",
                    quote: "אהבתי את הסדר והעיצוב. מרגיש מושקע ונגיש. כל פרט באתר הזה נראה כאילו הושקעה בו מחשבה רבה, וזה פשוט מדהים. אני חושב שזה אחד האתרים הכי טובים שראיתי מבחינת חוויית משתמש. כל כך קל למצוא את מה שאני מחפש, וזה פשוט תענוג. תודה על החוויה הנהדרת!",
                    role: "מעצב אתרים",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379389/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.48.48_hajf4e.jpg",
                        alt: "תמונה של דניאל כהן",
                    },
                },
                {
                    name: "אנה טולדנו",
                    quote: "ברגע שנכנסתי הבנתי שזה המקום הנכון לי. אהבתי את האנרגיה! האתר הזה פשוט מדהים, ואני לא יכולה להפסיק להתרשם מהעיצוב ומהתוכן. זה מרגיש כאילו כל פרט כאן נוצר במיוחד בשבילי. אני כל כך שמחה שמצאתי אתכם, ואני בטוחה שאחזור שוב ושוב. תודה על הכל!",
                    role: "מבקרת ראשונה",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379391/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.49.25_exulqi.jpg",
                        alt: "תמונה של אנה טולדנו",
                    },
                },
            ],
        },
        faq: {
            isEnabled: true,
            title: "שאלות נפוצות",
            questions: [
                {
                    question: "מה ההבדל בין סדנה פרטית לסדנה קבוצתית?",
                    answer: "סדנה פרטית מיועדת לקבוצות סגורות – ימי הולדת, גיבוש צוותי, זוגות וכו', ונקבעת בתיאום אישי. סדנה קבוצתית פתוחה לקהל הרחב ומתקיימת בתאריכים קבועים מראש.",
                },
                {
                    question: "האם יש צורך בידע מוקדם כדי להשתתף בסדנה?",
                    answer: "ממש לא! הסדנאות שלנו מתאימות לכולם – גם למי שלא נגע בצמח מעולם. אנו מדריכים אתכם שלב אחרי שלב.",
                },
                {
                    question: "כמה זמן נמשכת הסדנה?",
                    answer: "הסדנה אורכת כ-3 שעות, תלוי בגודל הקבוצה וקצב ההתקדמות.",
                },
                {
                    question: "מה כולל המחיר של הסדנה?",
                    answer: "המחיר כולל את כל החומרים הנדרשים ליצירת טרריום אישי, הדרכה מקצועית, וכלי עבודה במהלך הסדנה.",
                },
                {
                    question: "אפשר לקחת את הטרריום הביתה?",
                    answer: "בוודאי! כל משתתף יוצא מהסדנה עם טרריום שהוא הכין בעצמו.",
                },
            ]
        },
        openForm: {
            isEnabled: true,
            title: "רוצים לשמוע עוד?",
            description: "שלחו לנו כאן במה אתם מתעניינים ונחזור אליכם ממש מהר.",
        }
    }

    return data
}

export default getHomeData