const getPublicWorkshopData = () => {
    const data = {
        header: {
            title: "הצטרפו לאחת מהסדנאות הקבוצתיות שלנו",
            paragraphs: [
                "רוצים ליצור טרריום משלכם?",
                "בואו לאחת מהסדנאות הקבוצתיות שלנו יחד עם עוד אנשים שאוהבים טבע ויצירה בדיוק כמוכם לעצב ולבנות את הטרריום שלכם. כל טרריום הוא יצירה אישית, ייחודית וקסומה שמייצגת אתכם.",
                "תקבלו את כל הידע, הכלים והחומרים הדרושים כדי ליצור טרריום ייחודי וקסום, שישקף את מי שאתם. תוך כדי עבודה עם מגוון רחב של צמחים וטחבים, תחברו בין הגוף והנפש ותגלו את כוחה המרגיע של היצירה וההפתעה של היצירתיות הטמונה בכם, שאותה תיקחו הביתה.",
                "אפשר לבוא לבד, בזוג ואפילו חבורה.",
            ],
        },
        workshopItems: [
            {
                title: "סדנא מתקדמת לעיצוב טרריום",
                description:
                    "נצלול לעולם הירוק והקטיפתי של הטחב ונלמד כיצד לשלב אותו בטרריום שלנו ושישגשג לאורך זמן, יחד עם מגוון צמחים מיוחדים נלמד לעצב מיקרו-נוף ייחודי ונשלב מיניאטורות עבודת יד ליצירת פסל בוטני מלא בחיים שימלא אתכם ביופי, השראה ורוגע ויישאר איתכם לאורך זמן. מספר המקומות מוגבל ל-10 אנשים בסדנא.",
                image: {
                    src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824381/sphog/5_qjkatd.jpg",
                    alt: "תמונה של סדנה פרטית"
                },
                buttonText: "למידע מתי הסדנאות הבאות",
            },
            {
                title: "טכניקות ייחודיות לעיצוב טרריום",
                description:
                    "הסדנאות מיועדות למי שרוצה להעמיק בטכניקות העיצוב של הטרריום ולקחת את היצירה שלו לרמה הבאה. בכל סדנא נצלול לטכניקה אחרת: טראסות ירוקות בהשראת שדות האורז של המזרח הרחוק, קיר צומח וירוק שמטפס על דופן הטרריום, עמוד אבנים פראי שממנו משתרגת צמחייה שופעת ועוד. מספר המקומות מוגבל ל-6 אנשים בסדנא.",
                image: {
                    src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824381/sphog/5_qjkatd.jpg",
                    alt: "תמונה של סדנה פרטית"
                },
                buttonText: "למידע מתי הסדנאות הבאות",

            },
            {
                title: "סדנאות משפחתיות מותאמות לילדים",
                description:
                    "מחפשים פעילות משפחתית מהנה ויצירתית? זאת ההזדמנות המושלמת לבלות זמן איכות עם הילדים והנכדים, להעשיר את הידע על עולם הצמחים, לבטא את היצירתיות המשפחתית ובסוף גם לקחת הביתה מזכרת ירוקה. בסדנא נעצב טרריום אישי ונשלב בו טחבים, צמחים ומיניאטורות עבודת יד. מספר המקומות מוגבל ל-10 אנשים בסדנא.",
                image: {
                    src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824381/sphog/5_qjkatd.jpg",
                    alt: "תמונה של סדנה פרטית"
                },
                buttonText: "למידע מתי הסדנאות הבאות",
            },
        ],
        workshopFormData: {
            header: {
                title: "הסדנאות הבאות שלנו",
                description: "ספרו לנו באיזה תאריך אתם מתעניינים ונשלח לכם את כל הפרטים.",
            },
            availableDates: [
                { date: new Date("2025-06-12"), hours: ["10:00-11:00", "14:00-15:00"] },
                { date: new Date("2025-06-13"), hours: ["09:00-10:00", "13:00-14:00"] },
                { date: new Date("2025-06-15"), hours: ["11:00-12:00", "15:00-16:00"] },
                { date: new Date("2025-06-16"), hours: ["10:00-11:00", "14:00-15:00"] },
                { date: new Date("2025-06-17"), hours: ["09:00-10:00", "13:00-14:00"] },
                { date: new Date("2025-06-18"), hours: ["11:00-12:00", "15:00-16:00"] },
                { date: new Date("2025-06-19"), hours: ["10:00-11:00", "14:00-15:00"] },
                { date: new Date("2025-06-20"), hours: ["09:00-10:00", "13:00-14:00"] },
                { date: new Date("2025-06-21"), hours: ["11:00-12:00", "15:00-16:00"] },
                { date: new Date("2025-06-22"), hours: ["10:00-11:00", "14:00-15:00"] },
                { date: new Date("2025-06-23"), hours: ["09:00-10:00", "13:00-14:00"] },
                { date: new Date("2025-06-24"), hours: ["11:00-12:00", "15:00-16:00"] },
                { date: new Date("2025-06-25"), hours: ["10:00-11:00", "14:00-15:00"] },
                { date: new Date("2025-06-26"), hours: ["09:00-10:00", "13:00-14:00"] },
                { date: new Date("2025-06-27"), hours: ["11:00-12:00", "15:00-16:00"] },
                { date: new Date("2025-06-28"), hours: ["10:00-11:00", "14:00-15:00"] },
                { date: new Date("2025-06-29"), hours: ["09:00-10:00", "13:00-14:00"] },
            ],
        },
        testimonials: {
            title: "לקוחות ממליצים",
            testimonials: [
                {
                    name: "רונית ברנס",
                    quote: "האנרגיה במקום הייתה מדהימה, וגם למדתי המון על טרריום. האנרגיה במקום הייתה מדהימה, וגם למדתי המון על טרריום. האנרגיה במקום הייתה מדהימה, וגם למדתי המון על טרריום. האנרגיה במקום הייתה מדהימה, וגם למדתי המון על טרריום.",
                    role: "משתתפת",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379392/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.49.39_pugj7r.jpg",
                        alt: "רונית ברנס",
                    },
                },
                {
                    name: "אלעד כהן",
                    quote: "הגעתי לבד ויצאתי עם חברים חדשים וחוויה מיוחדת. הגעתי לבד ויצאתי עם חברים חדשים וחוויה מיוחדת. הגעתי לבד ויצאתי עם חברים חדשים וחוויה מיוחדת. הגעתי לבד ויצאתי עם חברים חדשים וחוויה מיוחדת.",
                    role: "סטודנט",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379389/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.48.48_hajf4e.jpg",
                        alt: "אלעד כהן",
                    },
                },
                {
                    name: "שלי פרידמן",
                    quote: "כל כך נהניתי, חוויה שמשאירה טעם של עוד! כל כך נהניתי, חוויה שמשאירה טעם של עוד! כל כך נהניתי, חוויה שמשאירה טעם של עוד! כל כך נהניתי, חוויה שמשאירה טעם של עוד!",
                    role: "משתתפת בסדנה פתוחה",
                    image: {
                        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379391/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.49.25_exulqi.jpg",
                        alt: "שלי פרידמן",
                    },
                },
            ],
        },
        openForm: {
            title: "רוצים לשמוע עוד?",
            description: "שלחו לנו כאן במה אתם מתעניינים ונחזור אליכם ממש מהר.",
        }
    }

    return data
}

export default getPublicWorkshopData