const getTipsData = () => {
  const data = {
    header: {
      title: "כל מה שאתם צריכים לדעת על טרריום",
      paragraphs: [
        "כאן תמצאו מדריכים קצרים, סרטונים וטיפים שעושים סדר ועוזרים לכם לבנות ולעצב טרריום בבית.",
        "וגם איך הכי טוב לשמור על הטרריום שלכם מה לשתול, איך לטפל, ומה עושים כשמשהו לא עובד.",
      ]
    },
    videoTip: {
      title: "כלים בסיסיים להכנת טרריום",
      description: "רוצים להתחיל להכין טרריום ולא בטוחים באיזה כלים להשתמש? בסרטון הזה אני מסביר על הכלים הבסיסיים שכל יוצר טרריום צריך להכיר",
      media: {
        type: "video",
        src: "https://www.youtube.com/embed/hU1ATfaRyQg",
        alt: "YouTube Shorts Video",
        isPortrait: false,
      },
      image: {
        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1748281656/sphog/laptop-realistic_qugrqv.png",
        alt: "Laptop",
      },
    },
    tips:
      [
        {
          _id: 1,
          title: "איך לשמור על הטרריום בבית?",
          description: "טרריום אוהב שקט, יציבות ואור – אבל לא שמש ישירה. הנה מה שחשוב לדעת:",
          paragraphs: [
            "הכי טוב להאיר בתאורת לד לבנה. אפשר גם למקם אותו במקום מואר (כמו אור שקריא בו ספר), אבל בלי שמש ישירה! רצוי מאוד בחדר מאוורר.",
            "לרסס את הטחב והעלים רק במים מזוקקים, 1–2 פעמים בשבוע, תלוי במזג האוויר ואטימות הכלי. חשוב לא לשפוך מים ולוודא שהטרריום לא מוצף במים.",
            "הוא אוהב טמפרטורה של 10°–25°, זה מושלם בשבילו. מעל 32° – עלול להיהרס. ותזכרו שטרריום סגור צומח לאט – וזה בדיוק הקסם 🌱",
          ],
          image: {
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1749893918/sphog/%D7%98%D7%99%D7%A4_%D7%90%D7%99%D7%9A_%D7%9C%D7%A9%D7%9E%D7%95%D7%A8_%D7%A2%D7%9C_%D7%94%D7%98%D7%A8%D7%A8%D7%99%D7%95%D7%9D_-_%D7%98%D7%A8%D7%A8%D7%99%D7%95%D7%9D_%D7%90%D7%A7%D7%93%D7%9E%D7%99_dp1rzt.webp",
            alt: "תמונה - איך לשמור על הטרריום בבית",
          },
        },
        {
          _id: 2,
          title: "הטרריום שלי חולה?",
          description: "אלו הדברים הבסיסים שאתם צריכים להיזהר מהם, ומה כדאי לעשות:",
          paragraphs: [
            "עובש - קורים לבנים בין העלים? פלומה לבנבנה או אפורה שמופיעה לפתע? זה העובש שהתנגב לו ומאיים על איזון הטרריום. מה לעשות? הסירו את החלקים המלאים בעובש עם פינצטה. חטאו את המקום בעזרת קיסם אוזניים טבול במי חמצן 5% (אפשר להשיג ברשתות הפארם), אחרי אוורור של כמה דקות יש לרסס במים מזוקקים ולעקוב במשך כמה ימים שהעובש לא חזר.",
            "ריח רע - מריח קצת כמו ריקבון או ביוב? הטרריום שלכם יצא מאיזון ואתם צריכים להוסיף קצת פחם שינטרל את הזיהום ויטהר את הסביבה.",
          ],
          image: {
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1749893917/sphog/2%D7%94%D7%98%D7%A8%D7%A8%D7%99%D7%95%D7%9D_%D7%A9%D7%9C%D7%99_%D7%97%D7%95%D7%9C%D7%94_rdpvjc.webp",
            alt: "תמונה - הטרריום שלי חולה",
          },
        },
        // {
        //   _id: 3,
        //   title: "אוורור נכון של טרריום",
        //   description:
        //     "מומלץ לפתוח את הטרריום הסגור אחת לשבוע ל-30 דקות כדי לאזן את הלחות ולמנוע התפתחות עובש.",
        //   image: {
        //     src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824381/sphog/5_qjkatd.jpg",
        //     alt: "פתיחת טרריום לאוורור",
        //   },
        // },
        // {
        //   _id: 4,
        //   title: "שכבות נכונות בבסיס הטרריום",
        //   description:
        //     "הבסיס המומלץ לטרריום כולל חצץ לניקוז, שכבת פחם פעיל לטיהור ריחות ואז אדמה איכותית. הסדר הזה קריטי לבריאות הצמחים.",
        //   image: {
        //     src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747811095/sphog/workshop1_xqufgq.jpg",
        //     alt: "שכבות חצץ ואדמה בטרריום",
        //   },
        // },
      ],
    testimonials: {
      title: "לקוחות ממליצים",
      testimonials: [
        {
          name: "קרן",
          quote: "איזה חוויה מדהימה! אחת החוויות הכי מרתקות ויצירתיות שעברתי. סדנא מקצועית, מושקעת ומלאה באווירה נעימה ומפרגנת. כל שלב לווה בהסברים ברורים וטיפים קטנים שעושים הבדל גדול. תשומת הלב האישית והאווירה האינטימית איפשרה שפע של זמן לשאלות והתנסות מעשית אמיתית כשאייל מדריך ומכוון לאורך כל הדרך. חזרתי הביתה עם טרריום עוצר נשימה ועם כלים ורעיונות חדשים להמשך היצירה. ממליצה בחום!",
          role: "משתתפת בסדנא קבוצתית",
          image: {
              src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747765974/sphog/1_kawtgf.png",
              alt: "תמונה של קרן",
          },
      },
      {
        name: "רינה",
        quote: "היה כיף אדיר ותענוג צרוף. מבחינתי הכל עבד מושלם! אתה מנחה כריזמטי, מוכשר, ורואים את האהבה הגדולה שלך לעשייה הזו עם כל מילה שיוצאת לך מהפה וכל עלה שאתה מחזיק ביד :) תודה רבה!!!",
        role: "סדנת צוות",
        image: {
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1749895609/sphog/Refine-Intelligence-webp_kujhkx.webp",
            alt: "רינה",
        },
    },
    {
        name: "זיו",
        quote: "היינו בסדנא זוגית. האווירה הייתה נעימה, קלילה ומלמדת, והיה פשוט מעולה – איל מקצועי, סבלני, עם חיוך ותשומת לב. הרגשנו לגמרי בנוח, גם לשאול שאלות וגם פשוט ליהנות מהחוויה. ממליץ בחום",
        role: "סדנא זוגית",
        image: {
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747765974/sphog/1_kawtgf.png",
            alt: "זיו",
        },
    },
      ],
    },
    openForm: {
      title: "רוצים לשמוע עוד?",
      description: "שלחו לנו כאן במה אתם מתעניינים ונחזור אליכם ממש מהר.",
    }
  }

  return data
}

export default getTipsData