const getTipsData = () => {
  const data = {
    header: {
      title: "כל מה שאתם צריכים לדעת על טרריום",
      paragraphs: [
        "כאן תמצאו מדריכים קצרים, סרטונים וטיפים שעושים סדר ועוזרים לכם לבנות ולעצב טרריום בבית.",
        "וגם איך הכי טוב לשמור על הטרריום שלכם מה לשתול, איך לטפל, ומה עושים כשמשהו לא עובד.",
      ]
    },
    videoTip: {
      title: "כלים בסיסיים להכנת טרריום",
      description: "רוצים להתחיל להכין טרריום ולא בטוחים באיזה כלים להשתמש? בסרטון הזה אני מסביר על הכלים הבסיסיים שכל יוצר טרריום צריך להכיר",
      media: {
        type: "video",
        src: "https://www.youtube.com/embed/QqpkJ1zVeTQ",
        alt: "YouTube Shorts Video",
        isPortrait: false,
      },
      image: {
        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1748281656/sphog/laptop-realistic_qugrqv.png",
        alt: "Laptop",
      },
    },
    tips:
      [
        {
          _id: 1,
          title: "איך לשמור על הטרריום בבית",
          description: "טרריום אוהב שקט, יציבות ואור – אבל לא שמש ישירה. הנה מה שחשוב לדעת:",
          paragraphs: [
            "הכי טוב להאיר בתאורת לד לבנה. אפשר גם למקם אותו במקום מואר (כמו אור שקריא בו ספר), אבל בלי שמש ישירה! רצוי מאוד בחדר מאוורר.",
            "לרסס את הטחב והעלים רק במים מזוקקים, 1–2 פעמים בשבוע, תלוי במזג האוויר ואטימות הכלי. חשוב לא לשפוך מים ולוודא שהטרריום לא מוצף במים.",
            "הוא אוהב טמפרטורה של 10°–25°, זה מושלם בשבילו. מעל 32° – עלול להיהרס. ותזכרו שטרריום סגור צומח לאט – וזה בדיוק הקסם 🌱",
          ],
          image: {
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824379/sphog/6_c1w4lp.jpg",
            alt: "טרריום עם טיפות מים",
          },
        },
        {
          _id: 2,
          title: "הטרריום שלי חולה?",
          description: "אלו הדברים הבסיסים שאתם צריכים להיזהר מהם, ומה כדאי לעשות:",
          paragraphs: [
            "עובש - קורים לבנים בין העלים? פלומה לבנבנה או אפורה שמוופיעה לפתע? זה העובש שהתנגב לו ומאיים על איזון הטרריום. מה לעשות? הסירו את החלקים המלאים בעובש עם פינצטה. חטאו את המקום בעזרת קיסם אוזניים טבול במי חמצן 5% (אפשר להשיג ברשתות הפארם), אחרי אוורור של כמה דקות יש לרסס במים מזוקקים ולעקוב במשך כמה ימים שהעובש לא חזר.",
            "ריח רע - מריח קצת כמו ריקבון או ביוב? הטרריום שלכם יצא מאיזון ואתם צריכים להוסיף קצת פחם שינטרל את הזיהום ויטהר את הסביבה.",
          ],
          image: {
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824379/sphog/7_d1gf6g.jpg",
            alt: "בחירת צמחים לטרריום",
          },
        },
        // {
        //   _id: 3,
        //   title: "אוורור נכון של טרריום",
        //   description:
        //     "מומלץ לפתוח את הטרריום הסגור אחת לשבוע ל-30 דקות כדי לאזן את הלחות ולמנוע התפתחות עובש.",
        //   image: {
        //     src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747824381/sphog/5_qjkatd.jpg",
        //     alt: "פתיחת טרריום לאוורור",
        //   },
        // },
        // {
        //   _id: 4,
        //   title: "שכבות נכונות בבסיס הטרריום",
        //   description:
        //     "הבסיס המומלץ לטרריום כולל חצץ לניקוז, שכבת פחם פעיל לטיהור ריחות ואז אדמה איכותית. הסדר הזה קריטי לבריאות הצמחים.",
        //   image: {
        //     src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1747811095/sphog/workshop1_xqufgq.jpg",
        //     alt: "שכבות חצץ ואדמה בטרריום",
        //   },
        // },
      ],
    testimonials: {
      title: "לקוחות ממליצים",
      testimonials: [
        {
          name: "גדי הרשקוביץ",
          quote: "למדתי סוף סוף איך לטפל בעציץ כמו שצריך, תודה על ההסבר הברור! ההסברים באתר היו כל כך מפורטים ומדויקים, שזה ממש עזר לי להבין את כל מה שצריך לדעת על גידול צמחים. אני ממליץ לכל מי שאוהב גינון להיכנס ולקרוא את המידע המועיל הזה. זה פשוט שינה לי את כל הגישה לטיפול בצמחים שלי, ואני בטוח שגם לכם זה יעזור!",
          role: "חובב גינון",
          image: {
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379389/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.48.48_hajf4e.jpg",
            alt: "תמונה של גדי הרשקוביץ",
          },
        },
        {
          name: "שני לוי",
          quote: "הטיפים באתר פשוט הצילו לי את הטרריום מהתייבשות. לא ידעתי איך לטפל בו נכון, אבל בזכות ההסברים המפורטים והטיפים המדויקים, הצלחתי לשמור עליו במצב מושלם. אני כל כך שמחה שמצאתי את האתר הזה, כי הוא באמת עזר לי להבין את כל מה שצריך לדעת על טיפול בטרריום. תודה רבה על המידע המועיל והמקצועי!",
          role: "משתמשת ותיקה",
          image: {
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379391/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.49.25_exulqi.jpg",
            alt: "תמונה של שני לוי",
          },
        },
        {
          name: "אבי דיין",
          quote: "ניכר שמדובר באנשים מקצוענים. כל עצה הייתה בול. אני חייב לציין שהמידע באתר הזה הוא פשוט ברמה אחרת. כל טיפ שקראתי היה מדויק, ברור ומועיל, וזה ממש עזר לי לשפר את הטיפול בצמחים שלי. אני ממליץ בחום לכל מי שאוהב גינון להיכנס ולקרוא את המידע הזה. זה באמת שינה לי את כל הגישה לטיפול בצמחים, ואני בטוח שגם לכם זה יעזור!",
          role: "משתמש באתר",
          image: {
            src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1734379390/Let%27s%20Garden/WhatsApp_Image_2024-12-16_at_21.49.07_xlauuw.jpg",
            alt: "תמונה של אבי דיין",
          },
        },
      ],
    },
    openForm: {
      title: "רוצים לשמוע עוד?",
      description: "שלחו לנו כאן במה אתם מתעניינים ונחזור אליכם ממש מהר.",
    }
  }

  return data
}

export default getTipsData