import { CONFIG } from "@/config/config"

const PrivacyPolicy = () => {
  const { contactEmail } = CONFIG

  return (
    <section>
      <p>
        אנו מחויבים לשמירה על פרטיות המשתמשים באתר שלנו. מסמך זה מפרט כיצד אנו אוספים, משתמשים ושומרים על
        המידע שלך.
      </p>
      <h3 className="text-lg mt-2">איסוף מידע</h3>
      <p>
        אנו עשויים לאסוף מידע שאתה מספק לנו באופן ישיר, כמו שם, כתובת דוא&quot;ל ופרטים נוספים שתספק
        באופן וולונטרי.
      </p>
      <h3 className="text-lg mt-2">שימוש במידע</h3>
      <p>
        המידע הנאסף משמש למטרות שיפור חוויית המשתמש, לספק לך שירותים, ולתקשר איתך בנוגע לעדכונים ומבצעים.
      </p>
      <h3 className="text-lg mt-2">שיתוף מידע</h3>
      <p>
        אנו לא משתפים את המידע שלך עם צדדים שלישיים למעט במקרים שבהם נידרש על פי חוק או לצורך מתן שירותים
        מטעמנו.
      </p>
      <h3>אבטחת מידע</h3>
      <p>
        אנו מיישמים אמצעי אבטחה סבירים לשמירה על פרטיות המידע שלך. עם זאת, אין אבטחה מוחלטת באינטרנט.
      </p>
      <p className="mt-2">
        לכל שאלה או בירור נוסף, ניתן לפנות אלינו בכתובת: {contactEmail}
      </p>
    </section>
  )
}

export default PrivacyPolicy