import { CONFIG } from "@/config/config";

const TermsOfService = () => {
  const { contactEmail } = CONFIG

  return (
    <section>
      <p>
        ברוכים הבאים לאתר שלנו! השימוש באתר כפוף לתנאים המפורטים להלן. אם אינך מסכים לתנאים, אנא הימנע
        משימוש באתר.
      </p>
      <h3 className="text-lg mt-2">שימוש באתר</h3>
      <p>
        האתר נועד לשימוש אישי בלבד. השימוש בו לא ייעשה למטרות בלתי חוקיות, פוגעניות או בלתי מורשות.
      </p>
      <h3 className="text-lg mt-2">זכויות יוצרים</h3>
      <p>
        כל התכנים באתר מוגנים בזכויות יוצרים ואין להעתיקם, לשכפלם או להפיצם ללא אישור מפורש מאתנו.
      </p>
      <h3 className="text-lg mt-2">שינויים בתנאים</h3>
      <p>
        אנו שומרים לעצמנו את הזכות לעדכן את תנאי השימוש בכל עת. המשך שימושך באתר מהווה הסכמה לתנאים
        המעודכנים.
      </p>
      <p className="mt-2">
        לכל שאלה או בקשה, ניתן לפנות אלינו בכתובת: {contactEmail}
      </p>
    </section>
  )
};

export default TermsOfService;
